{
  "projet": [
    {
  "id": 1,
  "nom": "Datakill",
  "description": "On peut souvent entendre que le taux de criminalité augmente constamment. Mais qu’en sait-on vraiment ? Grâce à Datakill, il vous est possible de découvrir si le taux de meurtres augmente en France grâce à de nombreux graphiques et avec des données allant de 2016 jusqu’à Octobre 2025. Par la suite, on vous présente les plus grands tueurs français connus.",

  "caracteristiques": "La conception du site a débuté en <span class='tag'>Septembre 2025</span> et le développement a pris fin en <span class='tag'>Novembre 2025 </span>. Il a été réalisé dans le cadre d’un projet scolaire avec la participation de <span class='tag'>Clément Kerneis </span>, <span class='tag'> Léo Dang </span> et <span class='tag'> Minh Anh Pham </span>.\n \nLes langages utilisés sont : <span class='tag'> JavaScript </span>, <span class='tag'> HTML </span> et <span class='tag'>CSS </span>. Ce projet nous a permis de nous entraîner à être créatifs afin de mettre en forme des données pour qu’elles donnent envie au lecteur de les lire, et aussi de chercher des données qui sont vérifiées et sûres.\n \nOn a aussi appris à rédiger une vraie page de mentions légales de la manière la plus complète possible. Il a aussi été nécessaire d’apprendre à utiliser par nous-mêmes la bibliothèque <span class='tag'>D3.js </span>.\n \n Nous avons aussi décidé de notre propre chef d’utiliser, pour la toute première fois, <span class='tag'>GitHub </span> à plusieurs ; ainsi, nous avons pu apprendre sur le tas à l’utiliser correctement. Le site est responsive uniquement à partir d’une largeur de 1024 pixels du navigateur.",

  "image": "img/img-projet/datakill.webp",
  "url": "https://razzway.github.io/datakill/"
},

    {
  "id": 2,
  "nom": "Filmothèque",
  "description": "Dans une société où vos avis cinématographiques vous mettent dans des cases et où, si vous n’aimez pas tel film, c’est seulement parce que vous « n’y connaissez rien ». \n\nÀ l’ère où tout le monde écoute les avis de ceux qui se disent cinéphiles, tels que Regelegorilla, et où tout le monde possède une appli pour noter les films qu’il a vus, telle que Letterboxd, Filmothèque vous propose une alternative : un site où vous seuls pouvez voir vos avis et où vous pouvez vous livrer et mettre 5 étoiles à ce film que tout le monde a jugé horrible alors qu’il vous a chamboulé.",

  "caracteristiques": "La conception du site a débuté en <span class='tag'> Février 2025</span> et le développement a pris fin en <span class='tag'> Juin 2025</span>. Il a été réalisé dans le cadre d’un projet scolaire avec pour seule participation la mienne, <span class='tag'>Haya Chaibi</span>. \n\n Les langages utilisés sont : <span class='tag'>JavaScript</span>, <span class='tag>HTML</span>, <span class='tag'> CSS</span>, <span class='tag'>PHP</span> et <span class='tag'>MySQL</span>. Ce projet représente le tout premier site multipage que j’ai réalisé, mais aussi la première fois que j’utilisais du <span class='tag'>PHP</span>, l’utilisation de <span class='tag'>MySQL</span>, de représentation graphique de données et notamment un <span class='tag'>.htaccess</span>. Grâce à cela, il est possible de laisser des commentaires, mais aussi de rajouter des films pour ceux qui ont le mot de passe. Grâce à <span class='tag'>JavaScript</span>, j’ai même pu réaliser des filtres.\n\n Le site n’est pas responsive : il est utilisable uniquement en version desktop, à partir d’une largeur de 768 pixels du navigateur. Il y a eu un vrai travail sur la conception d’un site accessible grâce aux règles <span class='tag'>Opquast</span>.",

  "image": "img/img-projet/filmotheque.webp",
  "url": "https://webinventory.chaibi.projetsmmichamps.fr/"
},
    {
      "id": 3,
      "nom": "La Gamelle",
      "description": "Diversifier les repas de ses animaux dans une société où il est normal qu’un  animal mange tous les jours la même chose, c’est compliqué. Alors La Gamelle est là pour vous permettre de le faire.\n\nEn vous inscrivant, vous pourrez bénéficier de recettes pensées pour l’espèce de votre animal. Vous pouvez aussi mettre en favoris les recettes qui vous ont plu pour les retrouver plus facilement, et il est même possible de laisser des commentaires pour faire des retours sur les recettes que vous avez testées.\n\n Parce que nous voulons que les utilisateurs de La Gamelle puissent développer un vrai esprit de communauté, il est possible pour les utilisateurs de proposer une recette qui sera par la suite vérifiée par nos soins avant d’être publiée.",

      "caracteristiques": "La conception du site a débuté en <span class='tag'>Septembre 2025</span> avec un véritable travail sur l’UX et l’UI, et le développement a pris fin en <span class='tag'>Janvier 2026</span>. Il a été réalisé dans le cadre d’un projet scolaire avec la participation de <span class='tag'>Natalia Vilasse</span>,<span class='tag'>Lola Beneteau</span> et <span class='tag'>Reda Idmais</span>. \n\n Les langages utilisés sont : <span class='tag'>JavaScript</span>,<span class='tag'> HTML</span>, <span class='tag'>CSS</span> et <span class='tag'>PHP</span>. Ce projet nous a permis de mettre en pratique la création d’un <span class='tag'>back-office</span> complet et de coder en <span class='tag'>MVC</span>, notamment d’approfondir nos compétences dans l’utilisation à plusieurs de <span class='tag'>GitHub</span>. \n\n Il nous a aussi permis de nous entraîner à réaliser un site entièrement <span class='tag'>responsive</span>. Il nous a aussi appris toutes les étapes nécessaires en UX pour développer un site web, comme la réalisation de <span class='tag'>tests utilisateurs</span>, d’<span class='tag'>interviews utilisateurs</span> et la réalisation d’un <span class='tag'>benchmark</span>.",

      "image": "img/img-projet/lagamelle.webp",
      "url": "https://lagaamelle.fr/"
    },
    {
      "id": 4,
      "nom": "Interview",
      "description": "Est-ce que vous pensez tout savoir sur le métier de journaliste ? Grâce à cette interview d’Emma Flacard, journaliste au 1 Hebdo, apprenez-en plus sur ce métier qui nous est peu connu.",

      "caracteristiques": "Cette interview a été l’un des travaux audiovisuels les plus complets que j’ai pu proposer. Il a été réalisé dans le cadre d’un projet scolaire avec la participation de <span class='tag'>Romain Viktorovitch</span>, <span class='tag'>Clément Kerneis</span> et <span class='tag'>Maëlys Pohu</span> pour ce qui est de la partie <span class='tag'>prise de vue</span>, et le <span class='tag'>montage</span> a entièrement été fait par moi-même.\n\n Le projet a débuté en <span class='tag'>Septembre 2024</span> et a pris fin en <span class='tag'>Janvier 2025</span>. Le logiciel utilisé est <span class='tag'>Premiere Pro</span>. Pour ce projet, nous avons dû en apprendre plus sur le milieu du journalisme, mais aussi éplucher tous les journaux papier ou internet possibles afin de trouver la personne qui accepterait de faire cette interview. Nous avons appris à installer un plateau de tournage et à filmer avec une caméra en utilisant plusieurs plans. Nous avons aussi dû apprendre à utiliser <span class='tag'>Premiere Pro</span>.",

      "image": "img/img-projet/interview.webp",
      "url": "https://youtu.be/G11FQz8sYek"
    },
    {
      "id": 6,
      "nom": "Communication institutionnelle",
      "description": "Une campagne institutionnelle complète constituée de 3 bannières web, une affiche de campagne en orientation portrait et paysage, une page d’accueil de site web en responsive, un plan interactif pour le site web avec son interprétation pour le print, ainsi que d’un moodboard.",

      "caracteristiques": "Cette campagne institutionnelle a été réalisée en <span class='tag'>Novembre 2026</span>. Elle a été réalisée dans le cadre d’un projet scolaire avec la participation de <span class='tag'>Natalia Vilasse</span>. \n\n Les logiciels utilisés sont : <span class='tag'>Affinity</span> et <span class='tag'>Figma</span>. Ce projet a été un vrai défi. Tout d’abord, il a fallu trouver des atouts et une <span class='tag'>direction artistique</span> pour L’Isle-Adam, mais aussi, comme c’était la toute première fois que nous utilisions <span class='tag'>Affinity</span>, il a fallu nous défaire de nos habitudes de la suite Adobe afin de réaliser la meilleure version possible.",

      "image": "img/img-projet/campagne.webp",
      "url": "https://haya-chaibi.fr/Isle-Adam.pdf"
    }
  ]
}
